app/controllers/things_controller.rb

INSERT INTO "things" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jake"], ["created_at", "2017-09-14 15:00:15.490906"], ["updated_at", "2017-09-14 15:00:15.490906"]]
---
  def create
    @thing = Thing.new(thing_params)

    respond_to do |format|
      if @thing.save

UPDATE "things" SET "name" = ?, "updated_at" = ? WHERE "things"."id" = ?  [["name", "Jake is OK"], ["updated_at", "2017-09-14 15:05:32.503601"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @thing.update(thing_params)

SELECT  "things".* FROM "things" WHERE "things"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_thing
      @thing = Thing.find(params[:id])